hybridPorousFoam-tutorials/Example_Applications/Drainage_and_Imbibition/drainage/0/alpha.wetting
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.wetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1308328
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    leftFace
    {
        type            fixedValue;
        value           uniform 1;
    }
    rightFace
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
